{
  "Number.toString": "Returns a string representing the specified Number object",
  "String.toLowerCase": "Returns the calling string value converted to lowercase.",
  "ReferenceError": "Represents an error when a non-existent variable is referenced.",
  "Number.toExponential": "Returns a string representing the Number object in exponential notation",
  "URIError": "Represents an error when a malformed URI is encountered.",
  "String": "The String global object is a constructor for strings, or a sequence of characters.",
  "Math": "A built-in object that has properties and methods for mathematical constants and functions.",
  "String.replace": "Returns a new string with some or all matches of a pattern replaced by a replacement.  The pattern can be a string or a RegExp, and the replacement can be a string or a function to be called for each match.",
  "_JSON.parse": "Parse a string as JSON, optionally transforming the value produced by parsing.",
  "String.trim": "Removes whitespace from both ends of the string.",
  "Date.getTimezoneOffset": "Returns the time-zone offset from UTC, in minutes, for the current locale.",
  "RegExp.lastIndex": "A read/write integer property that specifies the index at which to start the next match.",
  "Array.reduce": "Apply a function against an accumulator and each value of the array (from left-to-right) as to reduce it to a single value.",
  "_Math.abs": "Returns the absolute value of a number.",
  "Object.toString": "Returns a string representing the object.",
  "_Math.sqrt": "Returns the square root of a number.",
  "Date.getDate": "Returns the day of the month for the specified date according to local time.",
  "Array.reduceRight": "Apply a function simultaneously against two values of the array (from right-to-left) as to reduce it to a single value.",
  "Boolean": "The Boolean object is an object wrapper for a boolean value.",
  "String.length": "Represents the length of a string.",
  "String.indexOf": "Returns the index within the calling String object of the first occurrence of the specified value, starting the search at fromIndex,\nreturns -1 if the value is not found.",
  "_Math.tan": "Returns the tangent of a number.",
  "_Math.ceil": "Returns the smallest integer greater than or equal to a number.",
  "Date.setFullYear": "Sets the full year for a specified date according to local time.\n",
  "decodeURI": "Decodes a Uniform Resource Identifier (URI) previously created by encodeURI or by a similar routine.",
  "String.toUpperCase": "Returns the calling string value converted to uppercase.",
  "Array.splice": "Changes the content of an array, adding new elements while removing old elements.",
  "_Math.LN10": "The natural logarithm of 10, approximately 2.302.",
  "Date.getTime": "Returns the numeric value corresponding to the time for the specified date according to universal time.",
  "TypeError": "Represents an error an error when a value is not of the expected type.",
  "Date.setUTCMilliseconds": "Sets the milliseconds for a specified date according to universal time.\n",
  "Array.indexOf": "Returns the first index at which a given element can be found in the array, or -1 if it is not present.",
  "Object": "Creates an object wrapper.",
  "Object.hasOwnProperty": "Returns a boolean indicating whether the object has the specified property.",
  "Date.setMonth": "Set the month for a specified date according to local time.",
  "_Math.cos": "Returns the cosine of a number.",
  "Function.bind": "Creates a new function that, when called, has its this keyword set to the provided value, with a given sequence of arguments preceding any provided when the new function was called.",
  "Date.getMonth": "Returns the month in the specified date according to local time.",
  "parseFloat": "Parses a string argument and returns a floating point number.",
  "Date.setMilliseconds": "Sets the milliseconds for a specified date according to local time.\n",
  "Array.reverse": "Reverses an array in place.  The first array element becomes the last and the last becomes the first.",
  "Array.length": "An unsigned, 32-bit integer that specifies the number of elements in an array.",
  "String.search": "Executes the search for a match between a regular expression and this String object.",
  "undefined": "The value undefined.",
  "isFinite": "Determines whether the passed value is a finite number.",
  "Array.lastIndexOf": "Returns the last index at which a given element can be found in the array, or -1 if it is not present. The array is searched backwards, starting at fromIndex.",
  "Date.getUTCDate": "Returns the day (date) of the month in the specified date according to universal time.\n",
  "Date.setUTCMonth": "Sets the month for a specified date according to universal time.\n",
  "Array.some": "Tests whether some element in the array passes the test implemented by the provided function.",
  "_Math.SQRT1_2": "The square root of 1/2; equivalently, 1 over the square root of 2, approximately 0.707.",
  "Array.map": "Creates a new array with the results of calling a provided function on every element in this array.",
  "Date.toDateString": "Returns the date portion of a Date object in human readable form in American English.",
  "Date.setSeconds": "Sets the seconds for a specified date according to local time.",
  "_Math": "A built-in object that has properties and methods for mathematical constants and functions.",
  "String.toLocaleLowerCase": "Returns the calling string value converted to lower case, according to any locale-specific case mappings.",
  "RegExp.exec": "Executes a search for a match in a specified string. Returns a result array, or null.",
  "String.substr": "Returns the characters in a string beginning at the specified location through the specified number of characters.",
  "Number.toFixed": "Formats a number using fixed-point notation",
  "Infinity": "A numeric value representing infinity.",
  "String.localeCompare": "Returns a number indicating whether a reference string comes before or after or is the same as the given string in sort order.",
  "Array.join": "Joins all elements of an array into a string.",
  "RegExp.test": "Executes the search for a match between a regular expression and a specified string. Returns true or false.",
  "EvalError": "Represents an error regarding the eval function.",
  "Date.getUTCSeconds": "Returns the seconds in the specified date according to universal time.\n",
  "Object.propertyIsEnumerable": "Returns a Boolean indicating whether the specified property is enumerable.",
  "Array.pop": "Removes the last element from an array and returns that element.",
  "_Math.sin": "Returns the sine of a number.",
  "Date.getSeconds": "Returns the seconds in the specified date according to local time.",
  "Date.toLocaleTimeString": "Converts a date to a string, returning the \"time\" portion using the current locale's conventions.",
  "Error.name": "A name for the type of error.",
  "String.split": "Splits a String object into an array of strings by separating the string into substrings.",
  "Array.push": "Mutates an array by appending the given elements and returning the new length of the array.",
  "_Math.E": "The base of natural logarithms, e, approximately 2.718.",
  "String.toLocaleUpperCase": "Returns the calling string value converted to upper case, according to any locale-specific case mappings.",
  "RegExp.multiline": "Reflects whether or not to search in strings across multiple lines.\n",
  "Date.getUTCMonth": "Returns the month of the specified date according to universal time.\n",
  "Date.setUTCSeconds": "Sets the seconds for a specified date according to universal time.\n",
  "Object.toLocaleString": "Returns a string representing the object. This method is meant to be overriden by derived objects for locale-specific purposes.",
  "_JSON.stringify": "Convert a value to JSON, optionally replacing values if a replacer function is specified, or optionally including only the specified properties if a replacer array is specified.",
  "_Math.round": "Returns the value of a number rounded to the nearest integer.",
  "isNaN": "Determines whether a value is NaN or not. Be careful, this function is broken. You may be interested in ECMAScript 6 Number.isNaN.",
  "_Math.atan": "Returns the arctangent (in radians) of a number.",
  "Array.every": "Tests whether all elements in the array pass the test implemented by the provided function.",
  "Date.getMilliseconds": "Returns the milliseconds in the specified date according to local time.",
  "Date.getYear": "Returns the year in the specified date according to local time.",
  "encodeURI": "Encodes a Uniform Resource Identifier (URI) by replacing each instance of certain characters by one, two, three, or four escape sequences representing the UTF-8 encoding of the character (will only be four escape sequences for characters composed of two \"surrogate\" characters).",
  "RegExp.ignoreCase": "Creates a regular expression object for matching text with a pattern.",
  "_Math.atan2": "Returns the arctangent of the quotient of its arguments.",
  "_Math.LN2": "The natural logarithm of 2, approximately 0.693.",
  "SyntaxError": "Represents an error when trying to interpret syntactically invalid code.",
  "RegExp.global": "Creates a regular expression object for matching text with a pattern.",
  "Object.isPrototypeOf": "Tests for an object in another object's prototype chain.",
  "_Math.LOG2E": "The base 2 logarithm of E (approximately 1.442).",
  "Object.valueOf": "Returns the primitive value of the specified object",
  "Array.unshift": "Adds one or more elements to the beginning of an array and returns the new length of the array.",
  "_JSON": "JSON (JavaScript Object Notation) is a data-interchange format.  It closely resembles a subset of JavaScript syntax, although it is not a strict subset. (See JSON in the JavaScript Reference for full details.)  It is useful when writing any kind of JavaScript-based application, including websites and browser extensions.  For example, you might store user information in JSON format in a cookie, or you might store extension preferences in JSON in a string-valued browser preference.",
  "String.charAt": "Returns the specified character from a string.",
  "_Math.acos": "Returns the arccosine (in radians) of a number.",
  "RegExp": "Creates a regular expression object for matching text with a pattern.",
  "_Math.LOG10E": "The base 10 logarithm of E (approximately 0.434).",
  "_Math.floor": "Returns the largest integer less than or equal to a number.",
  "Date.toTimeString": "Returns the time portion of a Date object in human readable form in American English.",
  "Array.filter": "Creates a new array with all elements that pass the test implemented by the provided function.",
  "_Math.exp": "Returns Ex, where x is the argument, and E is Euler's constant, the base of the natural logarithms.",
  "_Math.PI": "The ratio of the circumference of a circle to its diameter, approximately 3.14159.",
  "Date.setUTCHours": "Sets the hour for a specified date according to universal time.\n",
  "Date.setMinutes": "Sets the minutes for a specified date according to local time.",
  "Date.setUTCDate": "Sets the day of the month for a specified date according to universal time.\n",
  "String.charCodeAt": "Returns the numeric Unicode value of the character at the given index (except for unicode codepoints > 0x10000).",
  "eval": "Evaluates JavaScript code represented as a string.",
  "String.substring": "Returns a subset of a string between one index and another, or through the end of the string.",
  "Function.apply": "Calls a function with a given this value and arguments provided as an array (or an array like object).",
  "encodeURIComponent": "Encodes a Uniform Resource Identifier (URI) component by replacing each instance of certain characters by one, two, three, or four escape sequences representing the UTF-8 encoding of the character (will only be four escape sequences for characters composed of two \"surrogate\" characters).",
  "_Math.SQRT2": "The square root of 2, approximately 1.414.",
  "_Math.log": "Returns the natural logarithm (base E) of a number.",
  "RegExp.source": "A read-only property that contains the text of the pattern, excluding the forward slashes.\n",
  "String.match": "Used to retrieve the matches when matching a string against a regular expression.",
  "Array.concat": "Returns a new array comprised of this array joined with other array(s) and/or value(s).",
  "JSON": "JSON (JavaScript Object Notation) is a data-interchange format.  It closely resembles a subset of JavaScript syntax, although it is not a strict subset. (See JSON in the JavaScript Reference for full details.)  It is useful when writing any kind of JavaScript-based application, including websites and browser extensions.  For example, you might store user information in JSON format in a cookie, or you might store extension preferences in JSON in a string-valued browser preference.",
  "Date.setTime": "Sets the Date object to the time represented by a number of milliseconds since January 1, 1970, 00:00:00 UTC.\n",
  "Date.setDate": "Sets the day of the month for a specified date according to local time.",
  "Function": "Every function in JavaScript is actually a Function object.",
  "Array.forEach": "Executes a provided function once per array element.",
  "Number": "The Number JavaScript object is a wrapper object allowing you to work with numerical values. A Number object is created using the Number() constructor.",
  "Date.getDay": "Returns the day of the week for the specified date according to local time.",
  "Date.setUTCMinutes": "Sets the minutes for a specified date according to universal time.\n",
  "Date.getUTCDay": "Returns the day of the week in the specified date according to universal time.\n",
  "Date.toISOString": "JavaScript provides a direct way to convert a date object into a string in ISO format, the ISO 8601 Extended Format.",
  "Function.call": "Calls a function with a given this value and arguments provided individually.",
  "RangeError": "Represents an error when a number is not within the correct range allowed.",
  "NaN": "A value representing Not-A-Number.",
  "String.lastIndexOf": "Returns the index within the calling String object of the last occurrence of the specified value, or -1 if not found. The calling string is searched backward, starting at fromIndex.",
  "_Math.max": "Returns the largest of zero or more numbers.",
  "Date.toLocaleDateString": "Converts a date to a string, returning the \"date\" portion using the operating system's locale's conventions.\n",
  "Number.toPrecision": "The toPrecision() method returns a string representing the number to the specified precision.",
  "Error": "Creates an error object.",
  "Array.sort": "Sorts the elements of an array in place and returns the array.",
  "Array.shift": "Removes the first element from an array and returns that element. This method changes the length of the array.",
  "Date.getUTCHours": "Returns the hours in the specified date according to universal time.\n",
  "Date.getMinutes": "Returns the minutes in the specified date according to local time.",
  "Date": "Creates JavaScript Date instances which let you work with dates and times.",
  "_Math.pow": "Returns base to the exponent power, that is, baseexponent.",
  "decodeURIComponent": "Decodes a Uniform Resource Identifier (URI) component previously created by encodeURIComponent or by a similar routine.",
  "Date.setHours": "Sets the hours for a specified date according to local time, and returns the number of milliseconds since 1 January 1970 00:00:00 UTC until the time represented by the updated Date instance.",
  "Array": "The JavaScript Array global object is a constructor for arrays, which are high-level, list-like objects.",
  "parseInt": "Parses a string argument and returns an integer of the specified radix or base.",
  "_Math.random": "Returns a floating-point, pseudo-random number in the range [0, 1) that is, from 0 (inclusive) up to but not including 1 (exclusive), which you can then scale to your desired range.",
  "Date.getFullYear": "Returns the year of the specified date according to local time.",
  "Array.slice": "Returns a shallow copy of a portion of an array.",
  "_Math.min": "Returns the smallest of zero or more numbers.",
  "Date.toUTCString": "Converts a date to a string, using the universal time convention.",
  "Date.getHours": "Returns the hour for the specified date according to local time.",
  "Date.getUTCMinutes": "Creates JavaScript Date instances which let you work with dates and times.",
  "_Math.asin": "Returns the arcsine (in radians) of a number.",
  "Error.message": "A human-readable description of the error.",
  "Date.getUTCMilliseconds": "Returns the milliseconds in the specified date according to universal time.\n",
  "String.slice": "Extracts a section of a string and returns a new string.",
  "String.concat": "Combines the text of two or more strings and returns a new string.",
  "Date.setUTCFullYear": "Sets the full year for a specified date according to universal time.\n"
}Year": "Sets the full year for a specified date according to universal time.\n"
}